<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<title>Viaje organizado - 3ºeso</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<link href="estilo.css" rel="stylesheet" type="text/css" />
</head>

<body>

<div id="head">
  <h1>Viaje organizado<span class="sign">/</span>3&ordm;eso</h1>
  <h2>webquest</h2>
</div>

<div id="container">

<div id="menu">

    <ul>
          <li><a href="index.htm">inicio</a></li>
          <li><a href="tarea.html">tarea</a></li>
          <li><a href="proceso.html">proceso</a></li>
          <li><a href="recursos.html">recursos</a></li>
          <li><a href="evaluacion.html">evaluaci&oacute;n</a></li>
          <li><a href="conclusion.html">conclusi&oacute;n</a></li>
          <li><a href="creditos.html">cr&eacute;ditos</a></li>
    </ul>
  </div>
	 
	 <div id="sidebar">
	   <h2>Software</h2>
	   
	   <h3>Documento de texto</h3>
	   <p>Recopilaci&oacute;n de todo sobre nuestro viaje.</p>
       <img src="images/writer.png" alt="Imagen 1" width="89" height="121" />
	   
	   
	   <h3>Hoja de c&aacute;lculo</h3>
	   <p>Presupuesto detallado del viaje.</p>
       <img src="images/calc.png" alt="Imagen 2" width="95" height="121" />
	   
	   
	   <h3>Presentaci&oacute;n</h3>
	   <p>Diapositivas para mostrar el viaje a nuestr@s compa&ntilde;er@s.</p>
       <img src="images/impress.jpg" alt="Imagen 3" width="98" height="119" />	   
       
       <h3>B&uacute;squeda</h3>
	   <p>Realizaremos la b&uacute;squeda con los siguientes navegadores:</p>
       
       <p><em>Mozilla Firefox.</em></p>       
	   <img src="images/firefox.gif" alt="Imagen 4" width="70" height="70" />
       
       <p><em>&oacute; Google Chrome.</em></p>
	   <img src="images/chrome.png" alt="Imagen 5" width="70" height="70" />
       
       <p><em>&oacute; Internet Explorer.</em></p>
	   <img src="images/internet.gif" alt="Imagen 6" width="70" height="70" />
       	   
	 </div>

     <h1>Proceso</h1>
    <p><strong>PRIMERO:</strong> Decidir la ciudad/es que se van a visitar.</p>
    <p>
    <strong>SEGUNDO:</strong> Indagar   sobre el lugar al que nos referimos, ubicadlo geogr&aacute;ficamente y limitad la zona   sobre la que cre&eacute;is que ser&iacute;a viable el viaje (visitas incluidas), dentro del   tiempo previsto para la excursi&oacute;n (7 d&iacute;as), estableciendo un punto de partida y   otro de llegada.</p>
    <p>Para esto ten&eacute;is que tener en cuenta la distancia que pod&eacute;is   recorrer en un d&iacute;a, y buscar los puntos interesantes que se deben visitar. Todo   esto se realizar&aacute; en un <span class="sign">documento de texto</span>.    </p>
    <p>Adem&aacute;s, se debe situar en el   mapa al menos tres de los puntos que m&aacute;s inter&eacute;s tanto hist&oacute;rico como tur&iacute;stico,   realizando una breve descripci&oacute;n de cada uno de ellos, tanto en lo que se   refiere a su Historia, como unas pinceladas sobre su cultura, costumbres, sociedad, econom&iacute;a, sus gentes...</p>

<p><strong>TERCERO: </strong>Realizar un presupuesto   en una <span class="sign">hoja de c&aacute;lculo</span> indicando el precio detallado de cada paso que vais a dar   en el viaje.</p>
    <p>
<strong>CUARTO: </strong>Realizar una <span class="sign">presentaci&oacute;n Power Point</span> exponiendo y   situando como m&iacute;nimo cada una de las fotograf&iacute;as aportadas en el documento de texto, en el lugar adecuado del mapa, explicando algo de la historia del   lugar as&iacute; como de sus gentes, costumbres, econom&iacute;a, sociedad y   climatolog&iacute;a.</p>
    <p>
<strong>QUINTO:</strong> Al menos se debe visitar <span class="sign">cuatro lugares de inter&eacute;s tur&iacute;stico</span> a lo largo de las ciudades y pueblos visitados (no tienen por que ser los m&aacute;s conocidos)</p>
    <p>&iquest;Qu&eacute; debemos buscar?</p>
    <ul>
      <li>
        <p><span class="sign"><em>Hoteles</em>.</span> Buscar hoteles con disponibilidad para las fechas y para el   n&uacute;mero de personas. Nos fijaremos en el precio, y las caracter&iacute;sticas (pensi&oacute;n   completa, media pensi&oacute;n, piscina, proximidad con el centro, etc...)</p>
      </li>
      <li>
        <p><em class="sign">Viaje. </em>Encontrar el medio de transporte m&aacute;s apropiado para cada uno   de los destinos. Comparar precios, comodidad y horas de viaje.</p>
      </li>
      <li>
        <p><em class="sign">Que visitar.</em> Planificar los d&iacute;as con visitas a museos, catedrales,   casco antiguo de la ciudad, entradas a parques de atracciones, cines o teatros,   pasar el d&iacute;a en la playa, salir de fiesta por la noche, etc. Identificar un gran   n&uacute;mero de opciones pensando en los diferentes gustos de los compa&ntilde;eros.</p>
      </li>
      <li>
        <p><em class="sign">Restaurantes.</em> Buscar diferentes restaurantes, bares y cafeter&iacute;as   donde sirvan platos t&iacute;picos de la zona, para poder probar la gastronom&iacute;a   local.</p>
      </li>
      <li>
        <p><em class="sign">Como movernos. </em>Localizar las zonas para visitar en el mapa, el hotel   y las zonas de ocio, para elegir como movernos entre ellos, a pie, comprando un   bono de transporte, etc...</p>
      </li>
    </ul>
   
   
</div>

<div id="foot">

  <p><span class="left">&copy; 2011 - Jose Chamorro &bull; <!-- Por favor, no borrar ni modificar -->Dise&ntilde;o: <a href="http://www.caribdis.com.ar/" title="Dise&ntilde;o Web" target="_blank"> CARIBDIS</a></span> <span class="right"><a href="http://validator.w3.org/check/referer"><acronym title="eXtensible HyperText Markup Language">XHTML</acronym></a> &bull; <a href="http://jigsaw.w3.org/css-validator/check/referer"><acronym title="Cascading Style Sheets">CSS</acronym></a></span></p>

</div>

</body>
</html>