<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>XHTML &amp; CSS</title>
<link href="styles/general.css" rel="stylesheet" type="text/css" />
<link href="styles/code.css" rel="stylesheet" type="text/css" />
<link href="styles/roundedCorner.css" rel="stylesheet" type="text/css" />
<script src="js/codehighlighter.js" type="text/javascript"></script>
<script src="js/niftycube.js" type="text/javascript"></script>
<script type="text/javascript">
window.onload=function(){
	Nifty("div#mainContainer","big");
	Nifty("div#contentContainer","big");
	Nifty("ul.postnav a","small transparent");
	CodeHighlighter.init()
}
</script></head>
<body>
<div id="mainContainer">
  <h1>XHTML</h1>
  <p>&nbsp;</p>
  <div id="menu"><ul  class="postnav"><li><a href="index.html">Sumario</a></li>
  <li><a href="index.html">Anterior</a></li>
  <li><a href="comoFunciona.html">siguiente</a></li>
  </ul>
  </div>
  <div id="contentContainer">
    <h2>Introducci&oacute;n a XHTML</h2>
    <p><acronym title="eXtensible HyperText Markup Language">XHTML</acronym> (Lenguaje de Marcado de Hipertexto Extensible) es una versi&oacute;n m&aacute;s estricta y limpia de <acronym title="HyperText Markup Language">HTML</acronym>, que nace precisamente con el objetivo de remplazar a HTML ante su limitaci&oacute;n de uso con las cada vez m&aacute;s abundantes herramientas basadas en XML. XHTML extiende HTML 4.0 combinando la sintaxis de HTML -dise&ntilde;ado para mostrar datos- con la de <acronym title="eXtensible Markup Language">XML</acronym> -dise&ntilde;ado para describir los datos.</p>
    <h3>HTML</h3>
    <p><acronym title="HyperText Markup Language">HTML</acronym> sirve para mostrar informaci&oacute;n, indicando a la vez al  navegador de qu&eacute; manera se debe mostrar. Utiliza un conjunto finito de  etiquetas, y tiene una gram&aacute;tica muy laxa: etiquetas y atributos  indiferentemente en may&uacute;sculas o min&uacute;sculas, no obligatoriedad de  cerrar etiquetas, valores para los atributos que no es necesario  encerrar entre comillas&hellip;</p>
    <h3>XML</h3>
    <p>En general en inform&aacute;tica, no s&oacute;lo en desarrollo web, se utiliza un  lenguaje llamado XML (eXtended Markup Language). Es tambi&eacute;n un lenguaje  de marcado, es decir, utiliza etiquetas, pero extendido (ampliado), de  forma que no hay un conjunto finito de etiquetas, sino que el  desarrollador puede crear etiquetas seg&uacute;n las necesite. Por ejemplo, el  programador que est&aacute; desarrollando una aplicaci&oacute;n para la biblioteca  p&uacute;blica, puede decidir llamar a las etiquetas de su <acronym title="eXtensible Markup Language">XML</acronym> &ldquo;libro&rdquo;,  &ldquo;categoria&rdquo;, &ldquo;autor&rdquo;, &ldquo;fechapublicacion&rdquo;.</p>
    <p>Este lenguaje se utiliza como est&aacute;ndar para intercambiar datos entre  diferentes programas, (a diferencia de HTML, que serv&iacute;a para representar informaci&oacute;n de forma legible, XML s&oacute;lo sirve para intercambiar datos) sin importar que hayan sido desarrollados por diferentes  programadores. Para que los documentos XML escritos por un programa  puedan ser utilizados por otros programas, es necesario que su  gram&aacute;tica sea mucho m&aacute;s estricta que la de HTML (XML s&oacute;lo se puede  escribir en min&uacute;sculas, todas las etiquetas deben cerrarse, los valores  para los atributos deben entrecomillarse&hellip;).</p>
    <h3>XHTML, un lenguage de descripci&oacute;n de datos </h3>
    <p><acronym title="eXtensible HyperText Markup Language">XHTML</acronym> (eXtended Hypertext Markup Language, HTML ampliado) es un lenguaje  derivado de HTML y XML. Como HTML, sirve para representar informaci&oacute;n  (en forma de p&aacute;gina web), pero se beneficia de las caracter&iacute;sticas del  XML para a&ntilde;adir datos que el lector de la p&aacute;gina web no ver&aacute;, pero que  son necesarios para que la informaci&oacute;n de la p&aacute;gina web sea m&aacute;s  completa.</p>
    <p><acronym title="eXtensible HyperText Markup Language">XHTML</acronym> ha sido pensado para describir la estructura de la informaci&oacute;n (t&iacute;tulos, p&aacute;rrafos, listas, &iacute;magenes...) y pretende dejar a <acronym title="Cascading Style Sheets">CSS</acronym>. la labor de presentarla. Llevar a cabo la separaci&oacute;n entre el contenido y la presentaci&oacute;n del mismo es el objetivo fundamental del desarrollo en XHTML y CSS, y se revela de gran utilidad cuando un mismo contenido debe presentarse de distintas maneras para ser visto por terminales tan distintos como un ordenador, un tel&eacute;fono m&oacute;vil, una impresora o un lector de braille.</p>
    <p>&nbsp;</p>
    <p>&nbsp;</p>
    <p>&nbsp;</p>
    <p>&nbsp;</p>
  </div>
</div>
</body>
</html>
